---
title: StairRampFailures
classe: Autodesk.Revit.DB.BuiltInFailures+StairRampFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 187
---

# StairRampFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId ActualRiserHeightChanged { get; }` | `StairRampFailures.ActualRiserHeightChanged` | FailureDefinitionId |
| `FailureDefinitionId AntiparallelRampRisers { get; }` | `StairRampFailures.AntiparallelRampRisers` | FailureDefinitionId |
| `FailureDefinitionId AntiparallelRampRisersError { get; }` | `StairRampFailures.AntiparallelRampRisersError` | FailureDefinitionId |
| `FailureDefinitionId ArcRunRadiusTooSmall { get; }` | `StairRampFailures.ArcRunRadiusTooSmall` | FailureDefinitionId |
| `FailureDefinitionId ArcRunWidthTooLongFailure { get; }` | `StairRampFailures.ArcRunWidthTooLongFailure` | FailureDefinitionId |
| `FailureDefinitionId AutomaticLandingConvertedToSketchedLandingWarning { get; }` | `StairRampFailures.AutomaticLandingConvertedToSketchedLandingWarning` | FailureDefinitionId |
| `FailureDefinitionId BadBalustersPerTread { get; }` | `StairRampFailures.BadBalustersPerTread` | FailureDefinitionId |
| `FailureDefinitionId BadFillingSpacing { get; }` | `StairRampFailures.BadFillingSpacing` | FailureDefinitionId |
| `FailureDefinitionId BadRailings { get; }` | `StairRampFailures.BadRailings` | FailureDefinitionId |
| `FailureDefinitionId BadRailingsError { get; }` | `StairRampFailures.BadRailingsError` | FailureDefinitionId |
| `FailureDefinitionId BadRailProfile { get; }` | `StairRampFailures.BadRailProfile` | FailureDefinitionId |
| `FailureDefinitionId BadTreadRiserProfile { get; }` | `StairRampFailures.BadTreadRiserProfile` | FailureDefinitionId |
| `FailureDefinitionId BalustersTooClose { get; }` | `StairRampFailures.BalustersTooClose` | FailureDefinitionId |
| `FailureDefinitionId BalustersTooCloseAbsolute { get; }` | `StairRampFailures.BalustersTooCloseAbsolute` | FailureDefinitionId |
| `FailureDefinitionId BalusterUpsideDown { get; }` | `StairRampFailures.BalusterUpsideDown` | FailureDefinitionId |
| `FailureDefinitionId CannotAlignSupportOnPosts { get; }` | `StairRampFailures.CannotAlignSupportOnPosts` | FailureDefinitionId |
| `FailureDefinitionId CannotComputeRailElevation { get; }` | `StairRampFailures.CannotComputeRailElevation` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateBaluster { get; }` | `StairRampFailures.CannotCreateBaluster` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateBalusterPatterns { get; }` | `StairRampFailures.CannotCreateBalusterPatterns` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateCornerBalusters { get; }` | `StairRampFailures.CannotCreateCornerBalusters` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateLandingStringer { get; }` | `StairRampFailures.CannotCreateLandingStringer` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateMiddleStringer { get; }` | `StairRampFailures.CannotCreateMiddleStringer` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateMonolithicStairs { get; }` | `StairRampFailures.CannotCreateMonolithicStairs` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateNosing { get; }` | `StairRampFailures.CannotCreateNosing` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateOneOrMoreBaluster { get; }` | `StairRampFailures.CannotCreateOneOrMoreBaluster` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateOneOrMoreTreads { get; }` | `StairRampFailures.CannotCreateOneOrMoreTreads` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateOpenMiddleStringers { get; }` | `StairRampFailures.CannotCreateOpenMiddleStringers` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateRail { get; }` | `StairRampFailures.CannotCreateRail` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateRailGeom { get; }` | `StairRampFailures.CannotCreateRailGeom` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateRailWarn { get; }` | `StairRampFailures.CannotCreateRailWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateRiser { get; }` | `StairRampFailures.CannotCreateRiser` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateSideStringer { get; }` | `StairRampFailures.CannotCreateSideStringer` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateStairForLevelOverlapping { get; }` | `StairRampFailures.CannotCreateStairForLevelOverlapping` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateStringers { get; }` | `StairRampFailures.CannotCreateStringers` | FailureDefinitionId |
| `FailureDefinitionId CannotDrawStairs { get; }` | `StairRampFailures.CannotDrawStairs` | FailureDefinitionId |
| `FailureDefinitionId CannotDrawStairsError { get; }` | `StairRampFailures.CannotDrawStairsError` | FailureDefinitionId |
| `FailureDefinitionId CannotEndWithZeroRiser { get; }` | `StairRampFailures.CannotEndWithZeroRiser` | FailureDefinitionId |
| `FailureDefinitionId CannotGenerateFaces { get; }` | `StairRampFailures.CannotGenerateFaces` | FailureDefinitionId |
| `FailureDefinitionId CannotGenerateFacesError { get; }` | `StairRampFailures.CannotGenerateFacesError` | FailureDefinitionId |
| `FailureDefinitionId CannotGenerateRamp { get; }` | `StairRampFailures.CannotGenerateRamp` | FailureDefinitionId |
| `FailureDefinitionId CannotGenerateRampError { get; }` | `StairRampFailures.CannotGenerateRampError` | FailureDefinitionId |
| `FailureDefinitionId CannotMakeLanding { get; }` | `StairRampFailures.CannotMakeLanding` | FailureDefinitionId |
| `FailureDefinitionId CannotOffsetBoundary { get; }` | `StairRampFailures.CannotOffsetBoundary` | FailureDefinitionId |
| `FailureDefinitionId CannotOffsetRail { get; }` | `StairRampFailures.CannotOffsetRail` | FailureDefinitionId |
| `FailureDefinitionId CannotPlaceBalusterOffset { get; }` | `StairRampFailures.CannotPlaceBalusterOffset` | FailureDefinitionId |
| `FailureDefinitionId CannotPlaceBalusterPatterns { get; }` | `StairRampFailures.CannotPlaceBalusterPatterns` | FailureDefinitionId |
| `FailureDefinitionId CannotPlaceRailingOnStringerWarning { get; }` | `StairRampFailures.CannotPlaceRailingOnStringerWarning` | FailureDefinitionId |
| `FailureDefinitionId CannotProcessInStairsSketchEditMode { get; }` | `StairRampFailures.CannotProcessInStairsSketchEditMode` | FailureDefinitionId |
| `FailureDefinitionId CannotSplitRailingWithExtensions { get; }` | `StairRampFailures.CannotSplitRailingWithExtensions` | FailureDefinitionId |
| `FailureDefinitionId ContinuousRailFilletCreationError { get; }` | `StairRampFailures.ContinuousRailFilletCreationError` | FailureDefinitionId |
| `FailureDefinitionId ContinuousRailFilletCreationParallel { get; }` | `StairRampFailures.ContinuousRailFilletCreationParallel` | FailureDefinitionId |
| `FailureDefinitionId ContinuousRailFilletCreationWarning { get; }` | `StairRampFailures.ContinuousRailFilletCreationWarning` | FailureDefinitionId |
| `FailureDefinitionId ContinuousRailGometryCreationFailure { get; }` | `StairRampFailures.ContinuousRailGometryCreationFailure` | FailureDefinitionId |
| `FailureDefinitionId ContinuousRailNotContinuous { get; }` | `StairRampFailures.ContinuousRailNotContinuous` | FailureDefinitionId |
| `FailureDefinitionId ContinuousRailSupportPlacementFailure { get; }` | `StairRampFailures.ContinuousRailSupportPlacementFailure` | FailureDefinitionId |
| `FailureDefinitionId ContinuousRailTransitionFailure { get; }` | `StairRampFailures.ContinuousRailTransitionFailure` | FailureDefinitionId |
| `FailureDefinitionId ExtendBelowBaseGreaterThanLandingBaseElevation { get; }` | `StairRampFailures.ExtendBelowBaseGreaterThanLandingBaseElevation` | FailureDefinitionId |
| `FailureDefinitionId ExtendBelowBaseGreaterThanRunTopElevation { get; }` | `StairRampFailures.ExtendBelowBaseGreaterThanRunTopElevation` | FailureDefinitionId |
| `FailureDefinitionId FailToReOrientSketchCurvesFailure { get; }` | `StairRampFailures.FailToReOrientSketchCurvesFailure` | FailureDefinitionId |
| `FailureDefinitionId HeightOfRunIsTooSmall { get; }` | `StairRampFailures.HeightOfRunIsTooSmall` | FailureDefinitionId |
| `FailureDefinitionId IntermediateLandingHigherThanTopRunFailure { get; }` | `StairRampFailures.IntermediateLandingHigherThanTopRunFailure` | FailureDefinitionId |
| `FailureDefinitionId InvalidBalustersPattern { get; }` | `StairRampFailures.InvalidBalustersPattern` | FailureDefinitionId |
| `FailureDefinitionId InvalidLocationLineJustificationFailure { get; }` | `StairRampFailures.InvalidLocationLineJustificationFailure` | FailureDefinitionId |
| `FailureDefinitionId InvalidParameters { get; }` | `StairRampFailures.InvalidParameters` | FailureDefinitionId |
| `FailureDefinitionId InvalidRailProfile { get; }` | `StairRampFailures.InvalidRailProfile` | FailureDefinitionId |
| `FailureDefinitionId InvalidStairsPathFailure { get; }` | `StairRampFailures.InvalidStairsPathFailure` | FailureDefinitionId |
| `FailureDefinitionId InvalidStartLevel { get; }` | `StairRampFailures.InvalidStartLevel` | FailureDefinitionId |
| `FailureDefinitionId InvalidStartLevelRamp { get; }` | `StairRampFailures.InvalidStartLevelRamp` | FailureDefinitionId |
| `FailureDefinitionId LandingDepthIsLessThanRunWidthWarning { get; }` | `StairRampFailures.LandingDepthIsLessThanRunWidthWarning` | FailureDefinitionId |
| `FailureDefinitionId LandingHeightUnderStairsBottom { get; }` | `StairRampFailures.LandingHeightUnderStairsBottom` | FailureDefinitionId |
| `FailureDefinitionId LandingShapeHandleOnPinnedRunFailure { get; }` | `StairRampFailures.LandingShapeHandleOnPinnedRunFailure` | FailureDefinitionId |
| `FailureDefinitionId MayUnjoinRailAndSupports { get; }` | `StairRampFailures.MayUnjoinRailAndSupports` | FailureDefinitionId |
| `FailureDefinitionId MultistoryLevelBelowTopbottomLevel { get; }` | `StairRampFailures.MultistoryLevelBelowTopbottomLevel` | FailureDefinitionId |
| `FailureDefinitionId MultistoryLevelBelowTopbottomLevelError { get; }` | `StairRampFailures.MultistoryLevelBelowTopbottomLevelError` | FailureDefinitionId |
| `FailureDefinitionId MultistoryStairDoesntReach { get; }` | `StairRampFailures.MultistoryStairDoesntReach` | FailureDefinitionId |
| `FailureDefinitionId MultistoryStairsAutomaticLevelLandingsDeleted { get; }` | `StairRampFailures.MultistoryStairsAutomaticLevelLandingsDeleted` | FailureDefinitionId |
| `FailureDefinitionId MultistoryStairsComponentJoinFailure { get; }` | `StairRampFailures.MultistoryStairsComponentJoinFailure` | FailureDefinitionId |
| `FailureDefinitionId MultistoryStairsHideTopLevelParameter { get; }` | `StairRampFailures.MultistoryStairsHideTopLevelParameter` | FailureDefinitionId |
| `FailureDefinitionId MultistoryStandardStairBottomEndExceedsOrNotReach { get; }` | `StairRampFailures.MultistoryStandardStairBottomEndExceedsOrNotReach` | FailureDefinitionId |
| `FailureDefinitionId MultistoryStandardStairTopEndExceedsOrNotReach { get; }` | `StairRampFailures.MultistoryStandardStairTopEndExceedsOrNotReach` | FailureDefinitionId |
| `FailureDefinitionId MultusegmentRampRiser { get; }` | `StairRampFailures.MultusegmentRampRiser` | FailureDefinitionId |
| `FailureDefinitionId MultusegmentRampRiserError { get; }` | `StairRampFailures.MultusegmentRampRiserError` | FailureDefinitionId |
| `FailureDefinitionId NoCurvesInRailing { get; }` | `StairRampFailures.NoCurvesInRailing` | FailureDefinitionId |
| `FailureDefinitionId NoProfileForRail { get; }` | `StairRampFailures.NoProfileForRail` | FailureDefinitionId |
| `FailureDefinitionId NoRailingsStringer { get; }` | `StairRampFailures.NoRailingsStringer` | FailureDefinitionId |
| `FailureDefinitionId NoRisersInPureMonolithicStairs { get; }` | `StairRampFailures.NoRisersInPureMonolithicStairs` | FailureDefinitionId |
| `FailureDefinitionId NoRunsRamp { get; }` | `StairRampFailures.NoRunsRamp` | FailureDefinitionId |
| `FailureDefinitionId NoRunsRampError { get; }` | `StairRampFailures.NoRunsRampError` | FailureDefinitionId |
| `FailureDefinitionId NotALineRiserRamp { get; }` | `StairRampFailures.NotALineRiserRamp` | FailureDefinitionId |
| `FailureDefinitionId NotALineRiserRampError { get; }` | `StairRampFailures.NotALineRiserRampError` | FailureDefinitionId |
| `FailureDefinitionId NotchThicknessIsLargerThanLandingWarning { get; }` | `StairRampFailures.NotchThicknessIsLargerThanLandingWarning` | FailureDefinitionId |
| `FailureDefinitionId NotEnoughRisers { get; }` | `StairRampFailures.NotEnoughRisers` | FailureDefinitionId |
| `FailureDefinitionId OnlyMonolithicStairs { get; }` | `StairRampFailures.OnlyMonolithicStairs` | FailureDefinitionId |
| `FailureDefinitionId PartOfRiserLiesOnBoundaryFailure { get; }` | `StairRampFailures.PartOfRiserLiesOnBoundaryFailure` | FailureDefinitionId |
| `FailureDefinitionId PathDoesntJoinToBorderRisersFailure { get; }` | `StairRampFailures.PathDoesntJoinToBorderRisersFailure` | FailureDefinitionId |
| `FailureDefinitionId RailCurveTooShort { get; }` | `StairRampFailures.RailCurveTooShort` | FailureDefinitionId |
| `FailureDefinitionId RailingBadOffset { get; }` | `StairRampFailures.RailingBadOffset` | FailureDefinitionId |
| `FailureDefinitionId RailingCurvesNotSplitRamp { get; }` | `StairRampFailures.RailingCurvesNotSplitRamp` | FailureDefinitionId |
| `FailureDefinitionId RailingCurvesNotSplitStairs { get; }` | `StairRampFailures.RailingCurvesNotSplitStairs` | FailureDefinitionId |
| `FailureDefinitionId RailingDoublyConnected { get; }` | `StairRampFailures.RailingDoublyConnected` | FailureDefinitionId |
| `FailureDefinitionId RailingNotConnected { get; }` | `StairRampFailures.RailingNotConnected` | FailureDefinitionId |
| `FailureDefinitionId RailPathCloseLoopForExtensionWarning { get; }` | `StairRampFailures.RailPathCloseLoopForExtensionWarning` | FailureDefinitionId |
| `FailureDefinitionId RailPlacedOutsideOfHost { get; }` | `StairRampFailures.RailPlacedOutsideOfHost` | FailureDefinitionId |
| `FailureDefinitionId RailProfileLowerThanFilletError { get; }` | `StairRampFailures.RailProfileLowerThanFilletError` | FailureDefinitionId |
| `FailureDefinitionId RailProfileLowerThanFilletFailure { get; }` | `StairRampFailures.RailProfileLowerThanFilletFailure` | FailureDefinitionId |
| `FailureDefinitionId RailProfileOpen { get; }` | `StairRampFailures.RailProfileOpen` | FailureDefinitionId |
| `FailureDefinitionId RailTypeChangeInconsistancyWarningWithResetBtn { get; }` | `StairRampFailures.RailTypeChangeInconsistancyWarningWithResetBtn` | FailureDefinitionId |
| `FailureDefinitionId RampDoesntReach { get; }` | `StairRampFailures.RampDoesntReach` | FailureDefinitionId |
| `FailureDefinitionId RampDoesntReachOffset { get; }` | `StairRampFailures.RampDoesntReachOffset` | FailureDefinitionId |
| `FailureDefinitionId RampLandingNotCreated { get; }` | `StairRampFailures.RampLandingNotCreated` | FailureDefinitionId |
| `FailureDefinitionId RampRunTooComplex { get; }` | `StairRampFailures.RampRunTooComplex` | FailureDefinitionId |
| `FailureDefinitionId RampStartHigherThanEnd { get; }` | `StairRampFailures.RampStartHigherThanEnd` | FailureDefinitionId |
| `FailureDefinitionId RiserCurveTooShort { get; }` | `StairRampFailures.RiserCurveTooShort` | FailureDefinitionId |
| `FailureDefinitionId RiserHeightIsTooSmall { get; }` | `StairRampFailures.RiserHeightIsTooSmall` | FailureDefinitionId |
| `FailureDefinitionId RiserIntWithBoundaryMoreThanOnceFailure { get; }` | `StairRampFailures.RiserIntWithBoundaryMoreThanOnceFailure` | FailureDefinitionId |
| `FailureDefinitionId RisersAtSameLocation { get; }` | `StairRampFailures.RisersAtSameLocation` | FailureDefinitionId |
| `FailureDefinitionId RiserThicknesssResetToZero { get; }` | `StairRampFailures.RiserThicknesssResetToZero` | FailureDefinitionId |
| `FailureDefinitionId RunBottomHigherThanTopFailure { get; }` | `StairRampFailures.RunBottomHigherThanTopFailure` | FailureDefinitionId |
| `FailureDefinitionId RunBottomUnderStairsBottomFailure { get; }` | `StairRampFailures.RunBottomUnderStairsBottomFailure` | FailureDefinitionId |
| `FailureDefinitionId RunIsJoiningLandingWithRiserSoNotchDoesNotWorkWarning { get; }` | `StairRampFailures.RunIsJoiningLandingWithRiserSoNotchDoesNotWorkWarning` | FailureDefinitionId |
| `FailureDefinitionId RunTopLowerThanBottomFailure { get; }` | `StairRampFailures.RunTopLowerThanBottomFailure` | FailureDefinitionId |
| `FailureDefinitionId SpiralRunRadiusTooSmallFailure { get; }` | `StairRampFailures.SpiralRunRadiusTooSmallFailure` | FailureDefinitionId |
| `FailureDefinitionId StairIncompleteFailure { get; }` | `StairRampFailures.StairIncompleteFailure` | FailureDefinitionId |
| `FailureDefinitionId StairsActualRiserHeightGreaterThanMaximumFailure { get; }` | `StairRampFailures.StairsActualRiserHeightGreaterThanMaximumFailure` | FailureDefinitionId |
| `FailureDefinitionId StairsActualRunWidthLessThanMinimumFailure { get; }` | `StairRampFailures.StairsActualRunWidthLessThanMinimumFailure` | FailureDefinitionId |
| `FailureDefinitionId StairsActualTreadDepthLessThanMinimumFailure { get; }` | `StairRampFailures.StairsActualTreadDepthLessThanMinimumFailure` | FailureDefinitionId |
| `FailureDefinitionId StairsAlreadyAttachedToCurrentLevel { get; }` | `StairRampFailures.StairsAlreadyAttachedToCurrentLevel` | FailureDefinitionId |
| `FailureDefinitionId StairsAreUpdatedDueToLevelHeightChange { get; }` | `StairRampFailures.StairsAreUpdatedDueToLevelHeightChange` | FailureDefinitionId |
| `FailureDefinitionId StairsAutomaticLandingLayoutFailure { get; }` | `StairRampFailures.StairsAutomaticLandingLayoutFailure` | FailureDefinitionId |
| `FailureDefinitionId StairsAutomaticLandingLayoutWarn { get; }` | `StairRampFailures.StairsAutomaticLandingLayoutWarn` | FailureDefinitionId |
| `FailureDefinitionId StairsBottomEndExceedsOrNotReachWarning { get; }` | `StairRampFailures.StairsBottomEndExceedsOrNotReachWarning` | FailureDefinitionId |
| `FailureDefinitionId StairsCannotExtendToFloorStructureLayerWarning { get; }` | `StairRampFailures.StairsCannotExtendToFloorStructureLayerWarning` | FailureDefinitionId |
| `FailureDefinitionId StairsCommonRunGenerateLayoutFailure { get; }` | `StairRampFailures.StairsCommonRunGenerateLayoutFailure` | FailureDefinitionId |
| `FailureDefinitionId StairsComponentJoinFailure { get; }` | `StairRampFailures.StairsComponentJoinFailure` | FailureDefinitionId |
| `FailureDefinitionId StairsCrossingRisersDisallowedFailure { get; }` | `StairRampFailures.StairsCrossingRisersDisallowedFailure` | FailureDefinitionId |
| `FailureDefinitionId StairsGenericFailure { get; }` | `StairRampFailures.StairsGenericFailure` | FailureDefinitionId |
| `FailureDefinitionId StairsGenericTransformFailure { get; }` | `StairRampFailures.StairsGenericTransformFailure` | FailureDefinitionId |
| `FailureDefinitionId StairsIllegalDesiredNumRisers { get; }` | `StairRampFailures.StairsIllegalDesiredNumRisers` | FailureDefinitionId |
| `FailureDefinitionId StairsInMultistoryExceedTopConstraint { get; }` | `StairRampFailures.StairsInMultistoryExceedTopConstraint` | FailureDefinitionId |
| `FailureDefinitionId StairsOnlySingleBoundaryHasRiserWithBothEndsOnBoundaryFailure { get; }` | `StairRampFailures.StairsOnlySingleBoundaryHasRiserWithBothEndsOnBoundaryFailure` | FailureDefinitionId |
| `FailureDefinitionId StairsOtherThan2IntsByRiserAndBoundaryFailure { get; }` | `StairRampFailures.StairsOtherThan2IntsByRiserAndBoundaryFailure` | FailureDefinitionId |
| `FailureDefinitionId StairsPathPositionResetWarning { get; }` | `StairRampFailures.StairsPathPositionResetWarning` | FailureDefinitionId |
| `FailureDefinitionId StairsRunRunJoinNotAllowedFailure { get; }` | `StairRampFailures.StairsRunRunJoinNotAllowedFailure` | FailureDefinitionId |
| `FailureDefinitionId StairsStartHigherThanEnd { get; }` | `StairRampFailures.StairsStartHigherThanEnd` | FailureDefinitionId |
| `FailureDefinitionId StairsStringerCannotBeCreated { get; }` | `StairRampFailures.StairsStringerCannotBeCreated` | FailureDefinitionId |
| `FailureDefinitionId StairsSubElementsNotConnectedWarning { get; }` | `StairRampFailures.StairsSubElementsNotConnectedWarning` | FailureDefinitionId |
| `FailureDefinitionId StairsSupportOverlapFailure { get; }` | `StairRampFailures.StairsSupportOverlapFailure` | FailureDefinitionId |
| `FailureDefinitionId StairsSupportTooShort { get; }` | `StairRampFailures.StairsSupportTooShort` | FailureDefinitionId |
| `FailureDefinitionId StairsTopEndExceedsOrNotReachWarning { get; }` | `StairRampFailures.StairsTopEndExceedsOrNotReachWarning` | FailureDefinitionId |
| `FailureDefinitionId StairsTopLowerThanBaseFailure { get; }` | `StairRampFailures.StairsTopLowerThanBaseFailure` | FailureDefinitionId |
| `FailureDefinitionId StairStringerCantOffset { get; }` | `StairRampFailures.StairStringerCantOffset` | FailureDefinitionId |
| `FailureDefinitionId StairsWinderGenLayoutFailure { get; }` | `StairRampFailures.StairsWinderGenLayoutFailure` | FailureDefinitionId |
| `FailureDefinitionId StairsWinderInvalidParamsFailure { get; }` | `StairRampFailures.StairsWinderInvalidParamsFailure` | FailureDefinitionId |
| `FailureDefinitionId StairsZeroDesiredRisers { get; }` | `StairRampFailures.StairsZeroDesiredRisers` | FailureDefinitionId |
| `FailureDefinitionId StringerCurvesNotSplitStairs { get; }` | `StairRampFailures.StringerCurvesNotSplitStairs` | FailureDefinitionId |
| `FailureDefinitionId StringerCurveTooShort { get; }` | `StairRampFailures.StringerCurveTooShort` | FailureDefinitionId |
| `FailureDefinitionId TooShortCurveDowngradeGeometry { get; }` | `StairRampFailures.TooShortCurveDowngradeGeometry` | FailureDefinitionId |
| `FailureDefinitionId TreadDepthBelowMin { get; }` | `StairRampFailures.TreadDepthBelowMin` | FailureDefinitionId |
| `FailureDefinitionId TreadDepthFailsEq { get; }` | `StairRampFailures.TreadDepthFailsEq` | FailureDefinitionId |
| `FailureDefinitionId TreadDepthTooBigFailure { get; }` | `StairRampFailures.TreadDepthTooBigFailure` | FailureDefinitionId |
| `FailureDefinitionId TreadFrontProfileInvalid { get; }` | `StairRampFailures.TreadFrontProfileInvalid` | FailureDefinitionId |
| `FailureDefinitionId UnableToCreateMultistoryStairs { get; }` | `StairRampFailures.UnableToCreateMultistoryStairs` | FailureDefinitionId |
| `FailureDefinitionId UnexpectedCurveIntersectionFailure { get; }` | `StairRampFailures.UnexpectedCurveIntersectionFailure` | FailureDefinitionId |
| `FailureDefinitionId WinderFilletRadiusTooLargeFailure { get; }` | `StairRampFailures.WinderFilletRadiusTooLargeFailure` | FailureDefinitionId |
| `FailureDefinitionId WinderFirstLegTooShortOrRunWidthTooGreatFailure { get; }` | `StairRampFailures.WinderFirstLegTooShortOrRunWidthTooGreatFailure` | FailureDefinitionId |
| `FailureDefinitionId WinderGenericError { get; }` | `StairRampFailures.WinderGenericError` | FailureDefinitionId |
| `FailureDefinitionId WinderLegIsTooShortFailure { get; }` | `StairRampFailures.WinderLegIsTooShortFailure` | FailureDefinitionId |
| `FailureDefinitionId WinderLegsAngleTooGreatOrRunWidthTooSmallFailure { get; }` | `StairRampFailures.WinderLegsAngleTooGreatOrRunWidthTooSmallFailure` | FailureDefinitionId |
| `FailureDefinitionId WinderLegTooShortOrRunWidthTooGreatFailure { get; }` | `StairRampFailures.WinderLegTooShortOrRunWidthTooGreatFailure` | FailureDefinitionId |
| `FailureDefinitionId WinderMinWidthTooLargeFailure { get; }` | `StairRampFailures.WinderMinWidthTooLargeFailure` | FailureDefinitionId |
| `FailureDefinitionId WinderMinWidthTooLargeForParallelTreadsFailure { get; }` | `StairRampFailures.WinderMinWidthTooLargeForParallelTreadsFailure` | FailureDefinitionId |
| `FailureDefinitionId WinderParallelLegsFailure { get; }` | `StairRampFailures.WinderParallelLegsFailure` | FailureDefinitionId |
| `FailureDefinitionId WinderParallelTreadsNumberFailure { get; }` | `StairRampFailures.WinderParallelTreadsNumberFailure` | FailureDefinitionId |
| `FailureDefinitionId WinderRunCreationFailure { get; }` | `StairRampFailures.WinderRunCreationFailure` | FailureDefinitionId |
| `FailureDefinitionId WinderRunInsideMinTreadDepthFailure { get; }` | `StairRampFailures.WinderRunInsideMinTreadDepthFailure` | FailureDefinitionId |
| `FailureDefinitionId WinderRunInsideWalklineOffsetFailure { get; }` | `StairRampFailures.WinderRunInsideWalklineOffsetFailure` | FailureDefinitionId |
| `FailureDefinitionId WinderRunWidthLessThan2TimesMinWidthFailure { get; }` | `StairRampFailures.WinderRunWidthLessThan2TimesMinWidthFailure` | FailureDefinitionId |
| `FailureDefinitionId WinderRunWidthLessThanWalkLineOffsetFailure { get; }` | `StairRampFailures.WinderRunWidthLessThanWalkLineOffsetFailure` | FailureDefinitionId |
| `FailureDefinitionId WinderRunWidthOrMinWidthOrTooGreatParallelTreadsFailure { get; }` | `StairRampFailures.WinderRunWidthOrMinWidthOrTooGreatParallelTreadsFailure` | FailureDefinitionId |
| `FailureDefinitionId WinderRunWidthOrMinWidthOrTooShortFailure { get; }` | `StairRampFailures.WinderRunWidthOrMinWidthOrTooShortFailure` | FailureDefinitionId |
| `FailureDefinitionId WinderSecondLegTooShortOrRunwidthTooGreatFailure { get; }` | `StairRampFailures.WinderSecondLegTooShortOrRunwidthTooGreatFailure` | FailureDefinitionId |
| `FailureDefinitionId WinderStraightStepsNumberFailure { get; }` | `StairRampFailures.WinderStraightStepsNumberFailure` | FailureDefinitionId |
| `FailureDefinitionId WinderThirdLegTooShortOrRunWidthTooGreatFailure { get; }` | `StairRampFailures.WinderThirdLegTooShortOrRunWidthTooGreatFailure` | FailureDefinitionId |
| `FailureDefinitionId WinderTooManyEndParallelTreadsOrRunWidthFailure { get; }` | `StairRampFailures.WinderTooManyEndParallelTreadsOrRunWidthFailure` | FailureDefinitionId |
| `FailureDefinitionId WinderTooManyParallelTreadsAtEndFailure { get; }` | `StairRampFailures.WinderTooManyParallelTreadsAtEndFailure` | FailureDefinitionId |
| `FailureDefinitionId WinderTooManyParallelTreadsAtHeadFailure { get; }` | `StairRampFailures.WinderTooManyParallelTreadsAtHeadFailure` | FailureDefinitionId |
| `FailureDefinitionId WinderTooManyStartParallelTreadsOrRunWidthFailure { get; }` | `StairRampFailures.WinderTooManyStartParallelTreadsOrRunWidthFailure` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```